Show / Hide Table of Contents
Class Reinforcement
Base class representing reinforcement in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
Hanging
HangingAroundPatch
ReinfFabric
ReinforcementGroup
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class Reinforcement : OpenElementId
Properties
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
ReinfId
Id representing reinforcement in Detail
Declaration
public int ReinfId { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source